{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_col": 3, "nb_row": 3, "name": "convolution2d_1", "trainable": true, "batch_input_shape": [null, 32, 128, 3], "b_regularizer": null, "dim_ordering": "tf", "input_dtype": "float32", "activation": "relu", "b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "bias": true, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "nb_filter": 16}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_col": 3, "nb_row": 3, "name": "convolution2d_2", "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "activation": "relu", "b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "bias": true, "W_constraint": null, "activity_regularizer": null, "nb_filter": 32}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_col": 3, "nb_row": 3, "name": "convolution2d_3", "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "activation": "relu", "b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "bias": true, "W_constraint": null, "activity_regularizer": null, "nb_filter": 64}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_1", "trainable": true, "init": "glorot_uniform", "output_dim": 500, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "bias": true, "activation": "relu", "input_dim": 1792, "W_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_2", "trainable": true, "init": "glorot_uniform", "output_dim": 100, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "bias": true, "activation": "relu", "input_dim": 500, "W_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.25, "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_3", "trainable": true, "init": "glorot_uniform", "output_dim": 20, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "bias": true, "activation": "relu", "input_dim": 100, "W_constraint": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_4", "trainable": true, "init": "glorot_uniform", "output_dim": 1, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "bias": true, "activation": "linear", "input_dim": 20, "W_constraint": null}}]}